API-TEST1/Log/vtd_user.log

2021-07-05 09:22:47,187 [1] INFO  - Loaded appender: FileAppenderInternal
2021-07-05 09:22:47,228 [1] INFO  - Loaded appender: FileAppenderExternal
2021-07-05 09:22:47,229 [1] INFO  - Loaded appender: UserLoggerAppender
2021-07-05 09:22:47,231 [1] INFO  - Loaded appender: FileAppenderInternal
2021-07-05 09:22:47,231 [1] INFO  - Loaded appender: FileAppenderExternal
2021-07-05 09:22:47,232 [1] INFO  - Loaded appender: UserLoggerAppender
2021-07-05 09:22:48,787 [7] INFO  - Step 'Start' : Step 'Start' started
2021-07-05 09:22:48,900 [7] INFO  - Step 'Start' ended successfully
2021-07-05 09:22:48,905 [7] INFO  - Step 'Test Flow' : Step 'Test Flow' started
2021-07-05 09:22:48,907 [7] INFO  - Step 'Iteration 1' : Step 'Iteration 1' started
2021-07-05 09:22:48,908 [7] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2021-07-05 09:22:48,942 [7] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Frankfurt</ArrivalCity>
      <FlightDate>2022-02-22T00:00:00+02:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2021-07-05 09:22:49,423 [7] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-05 09:22:49,473 [7] INFO  - Returning the response to the previous channel
2021-07-05 09:22:49,479 [7] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:53 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:09 AM</DepartureTime>
          <FlightNumber>14686</FlightNumber>
          <Price>179.47</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>10:00 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15779</FlightNumber>
          <Price>161.9</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:45 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15781</FlightNumber>
          <Price>105.4</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:30 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15782</FlightNumber>
          <Price>173.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:09 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>15785</FlightNumber>
          <Price>104</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:33 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>15789</FlightNumber>
          <Price>106</Price>
        </Flight>
        <Flight>
          <Airline>DL</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>04:42 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15792</FlightNumber>
          <Price>178.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>03:57 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15793</FlightNumber>
          <Price>105.3</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>06:29 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:45 PM</DepartureTime>
          <FlightNumber>16102</FlightNumber>
          <Price>110.8</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:41 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:57 PM</DepartureTime>
          <FlightNumber>16396</FlightNumber>
          <Price>120.4</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2021-07-05 09:22:49,508 [7] INFO  - Structural Validation: True
2021-07-05 09:22:49,515 [7] INFO  - Step 'GetFlights' ended successfully
2021-07-05 09:22:49,516 [7] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2021-07-05 09:22:49,524 [7] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Business</Class>
        <CustomerName>tal</CustomerName>
        <DepartureDate>2022-02-22T00:00:00+02:00</DepartureDate>
        <FlightNumber>14686</FlightNumber>
        <NumberOfTickets>5</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2021-07-05 09:22:49,528 [7] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-05 09:22:49,539 [7] INFO  - Returning the response to the previous channel
2021-07-05 09:22:49,542 [7] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>97</OrderNumber>
        <TotalPrice>1794.7</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2021-07-05 09:22:49,547 [7] INFO  - Structural Validation: True
2021-07-05 09:22:49,551 [7] INFO  - Step 'CreateFlightOrder' ended successfully
2021-07-05 09:22:49,554 [7] INFO  - Step 'Iteration 1' ended successfully
2021-07-05 09:22:49,555 [7] INFO  - Step 'Iteration 2' : Step 'Iteration 2' started
2021-07-05 09:22:49,557 [7] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2021-07-05 09:22:49,559 [7] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Frankfurt</ArrivalCity>
      <FlightDate>2022-02-22T00:00:00+02:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2021-07-05 09:22:49,562 [7] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-05 09:22:49,570 [7] INFO  - Returning the response to the previous channel
2021-07-05 09:22:49,572 [7] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:53 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:09 AM</DepartureTime>
          <FlightNumber>14686</FlightNumber>
          <Price>179.47</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>10:00 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15779</FlightNumber>
          <Price>161.9</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:45 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15781</FlightNumber>
          <Price>105.4</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:30 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15782</FlightNumber>
          <Price>173.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:09 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>15785</FlightNumber>
          <Price>104</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:33 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>15789</FlightNumber>
          <Price>106</Price>
        </Flight>
        <Flight>
          <Airline>DL</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>04:42 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15792</FlightNumber>
          <Price>178.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>03:57 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15793</FlightNumber>
          <Price>105.3</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>06:29 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:45 PM</DepartureTime>
          <FlightNumber>16102</FlightNumber>
          <Price>110.8</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:41 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:57 PM</DepartureTime>
          <FlightNumber>16396</FlightNumber>
          <Price>120.4</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2021-07-05 09:22:49,579 [7] INFO  - Structural Validation: True
2021-07-05 09:22:49,582 [7] INFO  - Step 'GetFlights' ended successfully
2021-07-05 09:22:49,583 [7] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2021-07-05 09:22:49,586 [7] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Business</Class>
        <CustomerName>tal</CustomerName>
        <DepartureDate>2022-02-22T00:00:00+02:00</DepartureDate>
        <FlightNumber>14686</FlightNumber>
        <NumberOfTickets>5</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2021-07-05 09:22:49,593 [7] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-05 09:22:49,604 [7] INFO  - Returning the response to the previous channel
2021-07-05 09:22:49,605 [7] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>98</OrderNumber>
        <TotalPrice>1794.7</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2021-07-05 09:22:49,612 [7] INFO  - Structural Validation: True
2021-07-05 09:22:49,614 [7] INFO  - Step 'CreateFlightOrder' ended successfully
2021-07-05 09:22:49,616 [7] INFO  - Step 'Iteration 2' ended successfully
2021-07-05 09:22:49,618 [7] INFO  - Step 'Iteration 3' : Step 'Iteration 3' started
2021-07-05 09:22:49,619 [7] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2021-07-05 09:22:49,630 [7] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Frankfurt</ArrivalCity>
      <FlightDate>2022-02-22T00:00:00+02:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2021-07-05 09:22:49,634 [7] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-05 09:22:49,644 [7] INFO  - Returning the response to the previous channel
2021-07-05 09:22:49,647 [7] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:53 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:09 AM</DepartureTime>
          <FlightNumber>14686</FlightNumber>
          <Price>179.47</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>10:00 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15779</FlightNumber>
          <Price>161.9</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:45 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15781</FlightNumber>
          <Price>105.4</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:30 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15782</FlightNumber>
          <Price>173.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:09 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>15785</FlightNumber>
          <Price>104</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:33 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>15789</FlightNumber>
          <Price>106</Price>
        </Flight>
        <Flight>
          <Airline>DL</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>04:42 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15792</FlightNumber>
          <Price>178.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>03:57 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15793</FlightNumber>
          <Price>105.3</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>06:29 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:45 PM</DepartureTime>
          <FlightNumber>16102</FlightNumber>
          <Price>110.8</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:41 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:57 PM</DepartureTime>
          <FlightNumber>16396</FlightNumber>
          <Price>120.4</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2021-07-05 09:22:49,655 [7] INFO  - Structural Validation: True
2021-07-05 09:22:49,658 [7] INFO  - Step 'GetFlights' ended successfully
2021-07-05 09:22:49,660 [7] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2021-07-05 09:22:49,663 [7] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Business</Class>
        <CustomerName>tal</CustomerName>
        <DepartureDate>2022-02-22T00:00:00+02:00</DepartureDate>
        <FlightNumber>14686</FlightNumber>
        <NumberOfTickets>5</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2021-07-05 09:22:49,665 [7] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-05 09:22:49,697 [7] INFO  - Returning the response to the previous channel
2021-07-05 09:22:49,699 [7] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>99</OrderNumber>
        <TotalPrice>1794.7</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2021-07-05 09:22:49,705 [7] INFO  - Structural Validation: True
2021-07-05 09:22:49,708 [7] INFO  - Step 'CreateFlightOrder' ended successfully
2021-07-05 09:22:49,711 [7] INFO  - Step 'Iteration 3' ended successfully
2021-07-05 09:22:49,713 [7] INFO  - Step 'Test Flow' ended successfully
2021-07-05 09:22:49,714 [7] INFO  - Step 'End' : Step 'End' started
2021-07-05 09:22:49,724 [7] INFO  - Step 'End' ended successfully
